app/controllers/admin/crops_controller.rb

  def index
    @crops = Crop.all
---
SELECT "crops".* FROM "crops"

  def create
    @crop = Crop.new(crop_params)
    @fertilisers = Fertiliser.all

    if @crop.save
---
INSERT INTO "crops" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 20 Apr 2012 00:52:31 UTC +00:00], ["name", "wheeat"], ["updated_at", Fri, 20 Apr 2012 00:52:31 UTC +00:00]]

  def destroy
    @crop.destroy
---
DELETE FROM "crops" WHERE "crops"."id" = $1  [["id", 1]]

  def load_crop
    @crop = Crop.find(params[:id])
---
SELECT "crops".* FROM "crops" WHERE "crops"."id" = $1 LIMIT 1  [["id", "4"]]